app/controllers/quizzes_controller.rb

    def answer
      @index = params[:index].to_i + 1
      puts params[:answer]
      puts @quiz.questions[@index - 2].description
      puts @quiz.questions[@index - 2].answer
      fredback = params[:answer] == @quiz.questions[@index - 2].answer.to_s ? "correct" : "incorrect"
      if @index >= @quiz.questions.count
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."quiz_id" = 1