app/controllers/registrations_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at") VALUES ('og@jog.com', '$2a$12$ZecoErW37lcdkxdPJQljvOpP4PeuNgDehQKMgs9ToFQekFrhUcIf.', '2025-02-05 13:07:40.122274', '2025-02-05 13:07:40.122274') RETURNING "id"
---
    def create
      @user = User.new(user_params)

      if @user.save